import React from 'react';
import Svg, { Path, Circle, Line, Polyline, G } from 'react-native-svg';
import { StyleProp, ViewStyle } from 'react-native';

interface TabIconProps {
  color?: string;
  size?: number;
  style?: StyleProp<ViewStyle>;
}

// 1. Главная (Домик)
export const HomeIcon = ({ 
  color = 'black', 
  size = 24, 
  style 
}: TabIconProps) => {
  return (
    <Svg 
      width={size} 
      height={size} 
      viewBox="0 0 122.88 121.135" 
      style={style}
    >
      <G>
        <Path 
          fill={color} 
          d="M74.401,65.787h41.427c1.943,0,3.707,0.791,4.982,2.068c1.276,1.275,2.069,3.039,2.069,4.982v41.246 c0,1.941-0.793,3.707-2.069,4.98c-1.275,1.277-3.039,2.07-4.982,2.07H74.401c-1.942,0-3.706-0.793-4.982-2.07 c-1.275-1.273-2.068-3.039-2.068-4.98V72.838c0-1.943,0.793-3.707,2.068-4.982C70.695,66.578,72.459,65.787,74.401,65.787 L74.401,65.787z M7.052,0h41.426c1.942,0,3.707,0.792,4.983,2.069s2.068,3.04,2.068,4.983v41.245c0,1.943-0.792,3.707-2.068,4.982 c-1.276,1.276-3.041,2.069-4.983,2.069H7.052c-1.934,0-3.692-0.793-4.969-2.069l-0.007-0.006l-0.007,0.006 C0.792,52.003,0,50.239,0,48.296V7.052c0-1.943,0.792-3.707,2.069-4.983C2.162,1.976,2.26,1.888,2.359,1.807 C3.607,0.685,5.255,0,7.052,0L7.052,0z M48.131,7.397H7.397V47.95h40.733V7.397L48.131,7.397z M74.401,0h41.427 c1.943,0,3.707,0.792,4.982,2.069c1.276,1.276,2.069,3.04,2.069,4.983v41.245c0,1.943-0.793,3.707-2.069,4.982 c-1.275,1.276-3.039,2.069-4.982,2.069H74.401c-1.942,0-3.706-0.793-4.982-2.069c-1.275-1.275-2.068-3.04-2.068-4.982V7.052 c0-1.943,0.793-3.707,2.068-4.983C70.695,0.792,72.459,0,74.401,0L74.401,0z M115.482,7.397H74.748V47.95h40.734V7.397 L115.482,7.397z M7.052,65.787h41.426c1.942,0,3.707,0.791,4.983,2.068c1.276,1.275,2.068,3.039,2.068,4.982v41.246 c0,1.941-0.792,3.707-2.068,4.98c-1.276,1.277-3.041,2.07-4.983,2.07H7.052c-1.934,0-3.692-0.793-4.969-2.07l-0.007-0.006 l-0.007,0.006C0.792,117.791,0,116.025,0,114.084V72.838c0-1.943,0.792-3.707,2.069-4.982c0.093-0.094,0.191-0.182,0.291-0.264 C3.607,66.471,5.255,65.787,7.052,65.787L7.052,65.787z M48.131,73.184H7.397v40.553h40.733V73.184L48.131,73.184z M115.482,73.184 H74.748v40.553h40.734V73.184L115.482,73.184z" 
        />
      </G>
    </Svg>
  );
}

// 2. Поиск (Лупа)
export const SearchIcon = ({ 
  color = 'black', 
  size = 24, 
  style 
}: TabIconProps) => {
  return (
    <Svg 
      width={size} 
      height={size} 
      viewBox="0 0 24 24" 
      style={style}
    >
      <Path 
        fill={color} 
        d="M15.5 14h-.79l-.28-.27A6.47 6.47 0 0 0 16 9.5A6.5 6.5 0 1 0 9.5 16c1.61 0 3.09-.59 4.23-1.57l.27.28v.79l5 4.99L20.49 19zm-6 0C7.01 14 5 11.99 5 9.5S7.01 5 9.5 5S14 7.01 14 9.5S11.99 14 9.5 14" 
      />
    </Svg>
  );
}

// 4. Мои уроки (Открытая книга)
export const BookIcon = ({ 
  color = 'black', 
  size = 24, 
  style 
}: TabIconProps) => {
  return (
    <Svg 
      width={size} 
      height={size} 
      viewBox="0 0 32 32" 
      style={style}
    >
      <Path 
        fill="none" 
        stroke={color} 
        strokeLinecap="round" 
        strokeLinejoin="round" 
        strokeWidth="2" 
        d="M16 7S9 1 2 6v22c7-5 14 0 14 0s7-5 14 0V6c-7-5-14 1-14 1m0 0v21" 
      />
    </Svg>
  );
}


// 5. Профиль (Силуэт пользователя)
export const UserIcon = ({ 
  color = 'black', 
  size = 24, 
  style 
}: TabIconProps) => {
  return (
    <Svg 
      width={size} 
      height={size} 
      viewBox="0 0 14 14" 
      style={style}
    >
      <G 
        fill="none" 
        stroke={color} 
        strokeLinecap="round" 
        strokeLinejoin="round" 
        // Здесь strokeWidth не указываем напрямую, чтобы он масштабировался 
        // пропорционально размеру viewBox (14x14)
      >
        <Circle cx="7" cy="5.5" r="2.5" />
        <Path d="M10.31 10.75a5 5 0 0 0-6.62 0m9.81-.25v2a1 1 0 0 1-1 1h-2m0-13h2a1 1 0 0 1 1 1v2m-13 0v-2a1 1 0 0 1 1-1h2m0 13h-2a1 1 0 0 1-1-1v-2" />
      </G>
    </Svg>
  );
}